OdDAI.CompressedGUID.generate
\details
Generates a new Compressed GUID object (pseudo constructor).
\returns The generated GUID object.

OdDAI.CompressedGUID.isValid
\details
Determines whether the Compressed GUID value is valid.
\returns true if the value is valid; otherwise the method returns false.

OdDAI.CompressedGUID.c_str
\details
Retrieves the constant raw pointer to the underlying string.
\returns A raw pointer to the C++ character array.

OdDAI.CompressedGUID.op_LessThan(OdDAI.CompressedGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
The "less-than" operator for Compressed GUID objects.
\param other [in] Another Compressed GUID value to be compared with (right-hand operand).
\returns true if the Compressed GUID value is less than the compared Compressed GUID value; otherwise the operator returns false.
\remarks
The Compressed GUID is less than another Compressed GUID if the string representation of the Compressed GUID is not equal to the string representation
of another Compressed GUID and the code of the first symbol that differs is less than the symbol code
in the same position in the string representation of the compared Compressed GUID.

OdDAI.CompressedGUID.op_Inequality(OdDAI.CompressedGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Inequality operator for Compressed GUID objects.
\param other [in] Another Compressed GUID value to be compared with (right-hand operand).
\returns true if the Compressed GUID object is not equal to another Compressed GUID object; otherwise, the method returns false.

OdDAI.CompressedGUID.op_Equality(OdDAI.CompressedGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator for Compressed GUID objects.
\param other [in] Another Compressed GUID value to be compared with (right-hand operand).
\returns true if the Compressed GUID object is equal to another Compressed GUID object; otherwise, the method returns false.

OdDAI.CompressedGUID.op_Assign(OdGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for Compressed GUID objects.
\param other [in] A new GUID value to be assigned.
\returns A reference to the Compressed GUID object modified with the assignment operation.

OdDAI.CompressedGUID.op_Assign(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for Compressed GUID objects.
\param s [in] A new Compressed GUID value to be assigned, represented as an ANSI string.
\returns A reference to the Compressed GUID object modified with the assignment operation.

OdDAI.CompressedGUID.#ctor(OdGUID!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates a new Compressed GUID based on an existing OdGUID value (copy constructor).
\param other [in] An OdGUID object that is used as a base for creating the Compressed GUID object.

OdDAI.CompressedGUID.#ctor
\details
Creates a new Compressed GUID object with default parameters.

OdDAI.CompressedGUID
\details
A class that implements generating and storing global unique identifiers (GUID) for Data Access Interface (DAI) objects.